src/cfe/InformationRegisters/OData4_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьКомпонентуДляРазбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СверкаДвижков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимПримененияПрофиля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимПравСлужебногоПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрогийРежимBasic</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СлужебныеПользователи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокеныПродолжения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокЖизниТокеновПродолжения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаголовокАдресаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоверятьЗаголовкуАдресаКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияНастроек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимЗаписиЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПачкиЖурнала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтервалПачкиЖурнала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДублироватьЖурналВЖурналРегистрации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьПараметрыЗапроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьТекстОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокХраненияЖурнала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникиCORS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимДат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьФизическоеУдаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПубликацииТокенов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверятьЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьIfMatch</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимПроведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвныеФлажки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтвергатьНеизвестныеСвойства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СубконтоВНаборахЗаписей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаибольшееЧислоОперацийBatch</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаибольшийРазмерBatchМБ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимРазбораТел</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КэшМетаданных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыдачаКоллекций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерПорцииВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаибольшееЧислоСтрокОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧислоДоверенныхПрокси</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьBasicСлужебнымУчёткам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖурналОтказовВхода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаСсылокЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючПриСоздании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПовторовЗапросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодробныеОшибкиЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоискСсылокПриУдалении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаибольшееЧислоРаскрытий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаибольшееЧислоЭлементовIn</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаибольшееЧислоЭлементовOrderby</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаибольшаяДлинаСтроковогоЛитерала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаибольшаяСложностьВыражения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьСубконтоНаборов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/CommonModules/OData4_НастройкиСервиса/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Единое чтение и запись настроек OData4 (регистр сведений OData4_Настройки без измерений — одна запись).
//
// Читаются все ресурсы регистра, какие есть в метаданных: ресурс, добавленный любой частью, появляется
// в результате без правки этого модуля. Пустое значение ресурса (запись не создана, ресурс добавлен после
// её записи, пустая строка, 0) заменяется значением по умолчанию из ПоУмолчанию(); у ресурса без значения
// по умолчанию остаётся пустое значение его типа. Булево читается как есть (ЗначениеЗаполнено(Ложь) = Истина), и
// Ложь в записи не отличить от «не задано», поэтому флажки называются так, чтобы Ложь было прежним поведением;
// исключение — флажки со значением по умолчанию Истина (ФлажкиИстинаПоУмолчанию, этап 6.2): их сохранённое
// значение действует, только если имя флажка записано в ресурсе ЯвныеФлажки (его дописывает Записать).

// Значения по умолчанию известных настроек: Структура «имя ресурса → значение». Ресурса может ещё не быть
// в регистре (его добавит другая часть этапа) — тогда значение отдаёт только Значение(Имя).
// Часть, добавившая ресурс с непустым значением по умолчанию, дописывает его сюда.
Функция ПоУмолчанию() Экспорт
	Значения = Новый Структура;
	Значения.Вставить("ИспользоватьКомпонентуДляРазбора", Ложь);
	Значения.Вставить("СверкаДвижков", Ложь);
	// 5.2: доступ.
	Значения.Вставить("РежимПримененияПрофиля", "ПредставлениеМодели");
	Значения.Вставить("РежимПравСлужебногоПользователя", "РолиКонфигурации");
	Значения.Вставить("СрокЖизниТокеновПродолжения", 600);
	// Этап 5.3: журнал выключен, CORS пустой, режим дат строгий, DELETE — пометка удаления.
	Значения.Вставить("УровеньЖурнала", "Выключен");
	Значения.Вставить("РежимЗаписиЖурнала", "Основной");
	Значения.Вставить("РазмерПачкиЖурнала", 50);
	Значения.Вставить("ИнтервалПачкиЖурнала", 10);
	Значения.Вставить("ДублироватьЖурналВЖурналРегистрации", Ложь);
	Значения.Вставить("СохранятьПараметрыЗапроса", Ложь);
	Значения.Вставить("СохранятьТекстОшибки", Ложь);
	Значения.Вставить("СрокХраненияЖурнала", 0);
	Значения.Вставить("ИсточникиCORS", "");
	Значения.Вставить("РежимДат", "Строгий");
	Значения.Вставить("РазрешитьФизическоеУдаление", Ложь);
	Значения.Вставить("АдресПубликации", "");
	Значения.Вставить("АдресПубликацииТокенов", "");
	// 6.2: запись — проверка заполнения включена, If-Match не требуется, проведение без параметра — неоперативное.
	Значения.Вставить("ПроверятьЗаполнение", Истина);
	Значения.Вставить("ТребоватьIfMatch", Ложь);
	Значения.Вставить("РежимПроведения", "Неоперативный");
	// 6.2, решение контроллера: неизвестные свойства тела записи пропускаются, как у standard.odata.
	Значения.Вставить("ОтвергатьНеизвестныеСвойства", Ложь);
	// 6.4: строки регистров бухгалтерии — как у standard.odata, без субконто.
	Значения.Вставить("СубконтоВНаборахЗаписей", Ложь);
	// Этап 7: $batch — не больше 100 операций (лимит профиля ОперацийBatch действует, если строже) и 10 МБ тела.
	Значения.Вставить("НаибольшееЧислоОперацийBatch", 100);
	Значения.Вставить("НаибольшийРазмерBatchМБ", 10);
	// Этап 8 (решение пользователя по замерам): выдача JSON — компонента (в безопасном режиме расширения и при её
	// сбое — язык 1С), разбор тел и вывод $metadata — язык 1С; готовый $metadata хранится между сеансами.
	Значения.Вставить("РежимВыдачи", "Компонента");
	Значения.Вставить("РежимРазбораТел", "BSL");
	Значения.Вставить("РежимМетаданных", "BSL");
	Значения.Вставить("КэшМетаданных", Истина);
	Значения.Вставить("ПроверкаКонфигурации", "Полная");
	// Выдача коллекций: страницами по 1000 строк (OData v4) или одним ответом без @odata.nextLink, порциями внутри
	// сервера (OData4_Чтение.КоллекцияОднимОтветом); 0 строк предела — без предела.
	Значения.Вставить("ВыдачаКоллекций", "Страницами");
	Значения.Вставить("РазмерПорцииВыдачи", 5000);
	Значения.Вставить("НаибольшееЧислоСтрокОтвета", 0);
	// Отзыв безопасности (группа A): адрес клиента — последний в списке заголовка, который дописал ближайший прокси;
	// отказы входа пишутся в журнал не чаще раза в минуту на сервис и адрес. РазрешитьBasicСлужебнымУчёткам — Ложь
	// (служебные учётки публикации токенов по Basic на сервис odata не входят), поэтому здесь не указан.
	Значения.Вставить("ЧислоДоверенныхПрокси", 1);
	Значения.Вставить("ЖурналОтказовВхода", "Прореживать");
	// Безопасность записи (отзыв, группа B): ссылки тела — существуют и видны профилю; Ref_Key при создании —
	// только у субъекта без отборов строк профиля (иначе ответ 409 раскрывал бы существование скрытого объекта);
	// ответы повторяемых запросов (Repeatability-Request-ID, Idempotency-Key) хранятся 24 ч; сырой текст исключения
	// записи клиенту не отдаётся; ссылки на физически удаляемый объект ищутся до транзакции удаления.
	Значения.Вставить("ПроверкаСсылокЗаписи", "ВидимостьПрофилю");
	Значения.Вставить("КлючПриСоздании", "БезОтборовПрофиля");
	Значения.Вставить("СрокПовторовЗапросов", 24);
	Значения.Вставить("ПодробныеОшибкиЗаписи", Ложь);
	Значения.Вставить("ПоискСсылокПриУдалении", "ДоТранзакции");
	// Субконто наборов движений регистров бухгалтерии при PATCH/PUT без субконто в строках — как у standard.odata (стираются).
	Значения.Вставить("СохранятьСубконтоНаборов", Ложь);
	// Отзыв безопасности: базовые лимиты запроса действуют всегда, и без профиля (лимит профиля — если строже);
	// пусто или 0 — эти значения (OData4_Безопасность.БазовыйЛимит).
	Значения.Вставить("НаибольшееЧислоРаскрытий", 200);
	Значения.Вставить("НаибольшееЧислоЭлементовIn", 500);
	Значения.Вставить("НаибольшееЧислоЭлементовOrderby", 32);
	Значения.Вставить("НаибольшаяДлинаСтроковогоЛитерала", 1000);
	Значения.Вставить("НаибольшаяСложностьВыражения", 1000);
	Возврат Значения;
КонецФункции

// Все ресурсы регистра OData4_Настройки: Структура «имя ресурса → значение» с подстановкой значений по
// умолчанию. Сбой чтения (нет прав, таблица недоступна) — исключение. Чтение — запросом, а не менеджером
// записи: с менеджером записи запрос, пришедший на границе 20 с простоя сеанса HTTP-сервиса (см.
// ПрочитатьБезОшибок), получал ответ 500 платформы «Тип не определен '<TypeId менеджера регистра>'» без
// записи в журнале регистрации (проба 5.3: 1 из 16); запрос к таблице даёт перехватываемую ошибку.
Функция Прочитать() Экспорт
	Умолчания = ПоУмолчанию();
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 * ИЗ РегистрСведений.OData4_Настройки КАК Н");
	Выборка = OData4_Хранилище.ВыполнитьЗапрос(Запрос).Выбрать();
	Выбрана = Выборка.Следующий();
	Явные = Новый Массив;
	Если Выбрана И Метаданные.РегистрыСведений.OData4_Настройки.Ресурсы.Найти(ИмяЯвныхФлажков()) <> Неопределено Тогда
		Явные = СтрРазделить(Выборка[ИмяЯвныхФлажков()], ",", Ложь);
	КонецЕсли;
	ФлажкиИстина = ФлажкиИстинаПоУмолчанию();
	Значения = Новый Структура;
	Для Каждого Ресурс Из Метаданные.РегистрыСведений.OData4_Настройки.Ресурсы Цикл
		ЗначениеРесурса = ?(Выбрана, Выборка[Ресурс.Имя], Ресурс.Тип.ПривестиЗначение(Неопределено));
		Если ФлажкиИстина.Найти(Ресурс.Имя) <> Неопределено Тогда
			// Флажок со значением по умолчанию Истина: сохранённое значение (и Ложь) действует, только если записано
			// явно; иначе — Истина (ЗначениеЗаполнено(Ложь) = Истина, поэтому общее правило ниже его не заменит).
			Значения.Вставить(Ресурс.Имя, ?(Явные.Найти(Ресурс.Имя) = Неопределено, Истина, ЗначениеРесурса));
			Продолжить;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЗначениеРесурса) И Умолчания.Свойство(Ресурс.Имя) Тогда
			ЗначениеРесурса = Умолчания[Ресурс.Имя];
		КонецЕсли;
		Значения.Вставить(Ресурс.Имя, ЗначениеРесурса);
	КонецЦикла;
	Возврат Значения;
КонецФункции

// Настройки на время вызова сервера (кэш OData4_ПовтИспВызова.Настройки): ФиксированнаяСтруктура, как
// Прочитать(). Регистр не прочитан — значения по умолчанию и предупреждение в журнале регистрации
// (событие OData4.Настройки): так же, как OData4_Движок.НастройкиДвижка, из-за сбоя платформы на границе
// простоя сеанса HTTP-сервиса и у пользователя без права чтения регистра.
Функция Действующие() Экспорт
	Возврат OData4_ПовтИспВызова.Настройки();
КонецФункции

// Значение одной настройки из Действующие(); ресурса нет в регистре — значение по умолчанию из
// ПоУмолчанию(), а если нет и его — ЗначениеПоУмолчанию.
Функция Значение(Имя, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Настройки = Действующие();
	Если Настройки.Свойство(Имя) Тогда
		Возврат Настройки[Имя];
	КонецЕсли;
	Умолчания = ПоУмолчанию();
	Если Умолчания.Свойство(Имя) Тогда
		Возврат Умолчания[Имя];
	КонецЕсли;
	Возврат ЗначениеПоУмолчанию;
КонецФункции

// Чтение без исключений для кэша на вызов (OData4_ПовтИспВызова.Настройки). Кроме ресурсов — поле
// НастройкиПрочитаны: Ложь — регистр не прочитан (таблицы расширения в сеансе недоступны), и код на пути
// запроса не обращается к регистрам расширения (журнал не пишется).
Функция ПрочитатьБезОшибок() Экспорт
	Попытка
		Значения = Прочитать();
		Значения.Вставить("НастройкиПрочитаны", Истина);
		Возврат Новый ФиксированнаяСтруктура(Значения);
	Исключение
		ЗаписьЖурналаРегистрации("OData4.Настройки", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Настройки не прочитаны, действуют значения по умолчанию: "
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	Значения = Новый Структура;
	Умолчания = ПоУмолчанию();
	Для Каждого Ресурс Из Метаданные.РегистрыСведений.OData4_Настройки.Ресурсы Цикл
		Значения.Вставить(Ресурс.Имя, ?(Умолчания.Свойство(Ресурс.Имя), Умолчания[Ресурс.Имя],
			Ресурс.Тип.ПривестиЗначение(Неопределено)));
	КонецЦикла;
	Значения.Вставить("НастройкиПрочитаны", Ложь);
	Возврат Новый ФиксированнаяСтруктура(Значения);
КонецФункции

// Меняет переданные ресурсы (Структура или Соответствие «имя → значение») и записывает запись целиком:
// остальные ресурсы сохраняют прежние значения. Имя, которого нет среди ресурсов регистра, — исключение.
// Если в регистре есть ресурс ВерсияНастроек (его добавляет часть 5.2), запись увеличивает его на 1, а
// переданное значение ВерсияНастроек не пишется: версия только растёт. ОжидаемаяВерсия — оптимистическая
// проверка (форма настроек): версия в регистре другая — исключение с текстом КонфликтВерсий, запись не
// выполняется. Без ресурса ВерсияНастроек проверка не выполняется.
Процедура Записать(Изменения, ОжидаемаяВерсия = Неопределено) Экспорт
	Ресурсы = Метаданные.РегистрыСведений.OData4_Настройки.Ресурсы;
	Для Каждого КлючИЗначение Из Изменения Цикл
		Если Ресурсы.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
			ВызватьИсключение "Нет настройки OData4: " + КлючИЗначение.Ключ;
		КонецЕсли;
	КонецЦикла;
	ОшибкиЗначений = ОшибкиЗначений(Изменения);
	Если ОшибкиЗначений.Количество() > 0 Тогда
		ВызватьИсключение СтрСоединить(ОшибкиЗначений, Символы.ПС);
	КонецЕсли;
	ЕстьВерсия = Ресурсы.Найти(ИмяВерсии()) <> Неопределено;
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("РегистрСведений.OData4_Настройки");
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		Менеджер = РегистрыСведений.OData4_Настройки.СоздатьМенеджерЗаписи();
		Менеджер.Прочитать();
		Если ЕстьВерсия Тогда
			Текущая = Менеджер[ИмяВерсии()];
			Конфликт = КонфликтВерсий(Текущая, ОжидаемаяВерсия);
			Если Не ПустаяСтрока(Конфликт) Тогда
				ВызватьИсключение Конфликт;
			КонецЕсли;
		КонецЕсли;
		Для Каждого КлючИЗначение Из Изменения Цикл
			Если КлючИЗначение.Ключ <> ИмяВерсии() Тогда
				Менеджер[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			КонецЕсли;
		КонецЦикла;
		ОтметитьЯвныеФлажки(Менеджер, Изменения, Ресурсы);
		Если ЕстьВерсия Тогда
			Менеджер[ИмяВерсии()] = Текущая + 1;
		КонецЕсли;
		Менеджер.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

// Допустимые значения настроек-списков: Соответствие «имя ресурса → Массив значений». Значение вне списка
// не записывается (замечание пользователя 4: поле со списком принимало произвольный текст).
Функция ДопустимыеЗначения() Экспорт
	Значения = Новый Соответствие;
	Значения.Вставить("УровеньЖурнала", СтрРазделить("Выключен,Запись,Ошибки,Всё", ","));
	Значения.Вставить("РежимЗаписиЖурнала", СтрРазделить("Основной,Буферизованный", ","));
	Значения.Вставить("РежимДат", СтрРазделить("Строгий,Совместимый", ","));
	Значения.Вставить("РежимПримененияПрофиля", СтрРазделить("ПредставлениеМодели,ПроверкиПоМесту", ","));
	Значения.Вставить("РежимПравСлужебногоПользователя",
		СтрРазделить("РолиКонфигурации,РолиРасширения,Привилегированный", ","));
	Значения.Вставить("РежимПроведения", СтрРазделить("Неоперативный,ОперативныйСегодня", ","));
	Для Каждого Имя Из СтрРазделить("РежимВыдачи,РежимРазбораТел,РежимМетаданных", ",") Цикл
		Значения.Вставить(Имя, СтрРазделить("BSL,Компонента,Сверка", ","));
	КонецЦикла;
	Значения.Вставить("ПроверкаКонфигурации", СтрРазделить("Полная,ПоВерсии", ","));
	Значения.Вставить("ВыдачаКоллекций", СтрРазделить("Страницами,ОднимОтветом", ","));
	Значения.Вставить("ЖурналОтказовВхода", СтрРазделить("Прореживать,Все,НеПисать", ","));
	Значения.Вставить("ПроверкаСсылокЗаписи", СтрРазделить("ВидимостьПрофилю,Существование,НеПроверять", ","));
	Значения.Вставить("КлючПриСоздании", СтрРазделить("БезОтборовПрофиля,Разрешён", ","));
	Значения.Вставить("ПоискСсылокПриУдалении", СтрРазделить("ДоТранзакции,ВТранзакции", ","));
	Возврат Значения;
КонецФункции

// Ошибки значений записываемых настроек: Массив текстов. Проверяются настройки-списки (ДопустимыеЗначения)
// и неотрицательные числовые настройки.
Функция ОшибкиЗначений(Изменения) Экспорт
	Ошибки = Новый Массив;
	Списки = ДопустимыеЗначения();
	Для Каждого КлючИЗначение Из Изменения Цикл
		Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			// Пустое значение ресурса читается как значение по умолчанию (см. Прочитать).
			Продолжить;
		КонецЕсли;
		Допустимые = Списки.Получить(КлючИЗначение.Ключ);
		Если Допустимые <> Неопределено И Допустимые.Найти(КлючИЗначение.Значение) = Неопределено Тогда
			Ошибки.Добавить("Настройка «" + КлючИЗначение.Ключ + "»: значение «" + Строка(КлючИЗначение.Значение)
				+ "» недопустимо, выберите одно из: " + СтрСоединить(Допустимые, ", "));
		КонецЕсли;
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Число") И КлючИЗначение.Значение < 0 Тогда
			Ошибки.Добавить("Настройка «" + КлючИЗначение.Ключ + "»: отрицательное значение "
				+ Формат(КлючИЗначение.Значение, "ЧН=0; ЧГ=0"));
		КонецЕсли;
	КонецЦикла;
	Возврат Ошибки;
КонецФункции

// Проверка списка разрешённых адресов токена: Массив текстов ошибок (пустой — список пригоден). Каждая
// непустая часть (разделители — запятая, точка с запятой и перевод строки) — адрес IPv4, IPv6 или подсеть
// вида адрес/длина префикса. Замечание пользователя 3: токен выпускался с адресом «abc».
Функция ОшибкиАдресовIP(Список) Экспорт
	Ошибки = Новый Массив;
	Если Список = Неопределено Тогда
		Возврат Ошибки;
	КонецЕсли;
	Если ТипЗнч(Список) <> Тип("Строка") Тогда
		Значение0 = ?(ТипЗнч(Список) = Тип("Число"), Формат(Список, "ЧН=0; ЧГ=0"), Строка(Список));
		Ошибки.Добавить("Разрешённые адреса задаются строкой, а передано значение типа «"
			+ Строка(ТипЗнч(Список)) + "»: " + Значение0);
		Возврат Ошибки;
	КонецЕсли;
	Для Каждого Часть Из СтрРазделить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Список, Символы.ВК, ""), ";", ","),
		Символы.ПС, ","), ",", Ложь) Цикл
		Адрес = СокрЛП(Часть);
		Если ПустаяСтрока(Адрес) Тогда
			Продолжить;
		КонецЕсли;
		Причина = ПричинаНедопустимогоАдреса(Адрес);
		Если Причина <> "" Тогда
			Ошибки.Добавить("Разрешённый адрес «" + Адрес + "»: " + Причина
				+ " (примеры: 10.0.0.1, 192.168.1.0/24, ::1)");
		КонецЕсли;
	КонецЦикла;
	Возврат Ошибки;
КонецФункции

// Адрес IPv4, IPv6 или подсеть «адрес/длина».
Функция АдресДопустим(Адрес) Экспорт
	Возврат ПричинаНедопустимогоАдреса(Адрес) = "";
КонецФункции

// Причина, по которой адрес непригоден («» — пригоден). Подсеть IPv4 («адрес/длина») сопоставляется по
// префиксу (OData4_Безопасность.АдресВПодсети); подсеть IPv6 не поддерживается и отвергается с фактом.
Функция ПричинаНедопустимогоАдреса(Адрес) Экспорт
	Текст = СокрЛП(Адрес);
	Косая = СтрНайти(Текст, "/");
	Если Косая > 0 Тогда
		Длина = Сред(Текст, Косая + 1);
		Текст = Лев(Текст, Косая - 1);
		Если СтрНайти(Текст, ":") > 0 Тогда
			Возврат "подсети IPv6 не поддерживаются, укажите адрес целиком";
		КонецЕсли;
		Если Не ЭтоЦелое(Длина) Или Число(Длина) > 32 Тогда
			Возврат "длина префикса подсети — целое число от 0 до 32";
		КонецЕсли;
	КонецЕсли;
	Если СтрНайти(Текст, ":") > 0 Тогда
		Возврат ?(АдресIPv6(Текст), "", "не IPv6-адрес");
	КонецЕсли;
	Возврат ?(АдресIPv4(Текст), "", "не IPv4-адрес и не подсеть");
КонецФункции

// Текст отказа оптимистической записи: пустая строка — версии совпадают или ожидаемая не задана.
Функция КонфликтВерсий(Текущая, ОжидаемаяВерсия) Экспорт
	Если ОжидаемаяВерсия = Неопределено Или Текущая = ОжидаемаяВерсия Тогда
		Возврат "";
	КонецЕсли;
	Возврат "Настройки OData4 изменены после их чтения: версия настроек " + Формат(Текущая, "ЧН=0; ЧГ=0")
		+ ", прочитана версия " + Формат(ОжидаемаяВерсия, "ЧН=0; ЧГ=0") + ". Запись не выполнена.";
КонецФункции

// Версия настроек из прочитанных значений; ресурса ВерсияНастроек нет — Неопределено.
Функция ВерсияИз(Значения) Экспорт
	Версия = Неопределено;
	Значения.Свойство(ИмяВерсии(), Версия);
	Возврат Версия;
КонецФункции

Функция ИмяВерсии()
	Возврат "ВерсияНастроек";
КонецФункции

// Булевы настройки со значением по умолчанию Истина (6.2): их Ложь отличается от «не задано» отметкой в ЯвныеФлажки.
Функция ФлажкиИстинаПоУмолчанию()
	Результат = Новый Массив;
	Для Каждого КлючИЗначение Из ПоУмолчанию() Цикл
		// Только Булево: число 1 в сравнении «= Истина» тоже даёт Истина (ЧислоДоверенныхПрокси по умолчанию 1).
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Булево") И КлючИЗначение.Значение Тогда
			Результат.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция ИмяЯвныхФлажков()
	Возврат "ЯвныеФлажки";
КонецФункции

// Дописывает в ЯвныеФлажки менеджера записи имена записываемых флажков со значением по умолчанию Истина. Если
// ЯвныеФлажки переданы в Изменения явно (например, пустыми — «все по умолчанию»), действует переданное значение.
Процедура ОтметитьЯвныеФлажки(Менеджер, Изменения, Ресурсы)
	Если Ресурсы.Найти(ИмяЯвныхФлажков()) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Для Каждого КлючИЗначение Из Изменения Цикл
		Если КлючИЗначение.Ключ = ИмяЯвныхФлажков() Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	Явные = СтрРазделить(Менеджер[ИмяЯвныхФлажков()], ",", Ложь);
	ФлажкиИстина = ФлажкиИстинаПоУмолчанию();
	Для Каждого КлючИЗначение Из Изменения Цикл
		Если ФлажкиИстина.Найти(КлючИЗначение.Ключ) <> Неопределено И Явные.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
			Явные.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	Менеджер[ИмяЯвныхФлажков()] = СтрСоединить(Явные, ",");
КонецПроцедуры

// Строка из одних цифр (и непустая).
Функция ЭтоЦелое(Текст)
	Если ПустаяСтрока(Текст) Или СтрДлина(Текст) > 3 Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Номер = 1 По СтрДлина(Текст) Цикл
		Если СтрНайти("0123456789", Сред(Текст, Номер, 1)) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

// Адрес IPv4: четыре числа 0–255 через точку.
Функция АдресIPv4(Текст)
	Части = СтрРазделить(Текст, ".", Истина);
	Если Части.Количество() <> 4 Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Каждого Часть Из Части Цикл
		Если Не ЭтоЦелое(Часть) Или Число(Часть) > 255 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

// Адрес IPv6: группы шестнадцатеричных цифр через «:», допускается одно сокращение «::».
Функция АдресIPv6(Текст)
	Если СтрЧислоВхождений(Текст, "::") > 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	Сокращение = СтрНайти(Текст, "::") > 0;
	Группы = СтрРазделить(СтрЗаменить(Текст, "::", ":"), ":", Ложь);
	Если Группы.Количество() = 0 Или Группы.Количество() > 8 Или (Не Сокращение И Группы.Количество() <> 8) Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Каждого Группа Из Группы Цикл
		Если ПустаяСтрока(Группа) Или СтрДлина(Группа) > 4 Тогда
			Возврат Ложь;
		КонецЕсли;
		Для Номер = 1 По СтрДлина(Группа) Цикл
			Если СтрНайти("0123456789abcdefABCDEF", Сред(Группа, Номер, 1)) = 0 Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Истина;
КонецФункции

// Включается ли привилегированный режим в коде расширения OData4. В безопасном режиме расширения
// УстановитьПривилегированныйРежим(Истина) исключения не вызывает, но режим не включается (проба П5
// плана 5.3): журнал и настройки читаются и пишутся правами пользователя запроса.
Функция ПривилегированныйРежимДоступен() Экспорт
	Если ПривилегированныйРежим() Тогда
		Возврат Истина;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Доступен = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Доступен;
КонецФункции

#КонецОбласти
